import random
k=0
spisok1=["Столярова", "Киселева", "Байол", "Яковлева", "Емельянова", "Киреева", "Овчинникова",  "Пискунова", "Чугунова", "Каськова"]
spisok2=["Иванов", "Петров", "Сидоров", "Мельникова", "Зарубин", "Ливцов", "Соколова", "Елохина", "Терещенко", "Михайлов"]
team = tuple(random. sample (spisok1, 5)+random. sample(spisok2, 5))
print('Студенты моей группы',spisok1)
print('Студенты другой группы',spisok2)
print('Спортивная команда',team)
print('Длина кортежа', len (team))
team = tuple(sorted (team))
print('Отсортированный список',team)
if 'Иванов' in team:
    k+=1
    print('В команду входит Иванов',k,'раз')
else:
    print('Иванов в команду не входит')